[UI_TREE] 
Machine = Настройки оборудования 
POWER = Особенности питания 
Touch = Настройка ног 

[IPG,CO2] 
MPULSE_FREQ = поддержание частоты импульсов (кГц) 
MPULSE_RELS = Поддержание времени высвобождения (us) 

[IPG] 
MO_DELAY_STEPS  = MO задержка (us) 
MODECHG_DELAY = Задержка переключения режимов (ms) 

[YAG,DP,EP,LD] 
WORK_CURRENT_TYPE = Получение значения тока в диалоге входа 
WORK_CURRENT_TYPEOption = Уровень 0 Ток | Заданное значение
WORK_CURRENT = Установить рабочий ток (A) 

[ALL] 
SAFE_DOOR = Безопасная дверь 
SAFE_DOOROption =Неверный | Приостановление | Остановитьd
MARKEND_SCAN = Позиция конечного осциллографа 
MARKEND_SCANOption =Происхождение | Верхний левый | Верхнее центральное положение | Верхний правый центр | Правый центр | Нижний центр | Нижний центр | Нижний угол | Левый угол | Левый центр | Пользовательское положение
MARKEND_X = Координаты Y при настройке (mm) 
(mm)
MARKEND_Y = Координаты Y при настройке (mm) 

[SCAN] 
PREHEAT_ENABLE = Требуется ли подогрев зеркала 
PREHEAT_ENABLEOption =Нет | Да
PREHEAT_TIME = Минимальное время подогрева (мин.) 
USE_LIMIT_JUMPDELAY = Включить задержку перехода 
USE_LIMIT_JUMPDELAYOption = Нет | Да
LIMIT_JUMPLEN = Ограниченное расстояние прыжка (mm) 
LIMIT_JUMPDELAY_MM = время прыжка на миллиметр (us) 

[BitmapPower] 
BitmapPower = График серого 
AUT_TIME = Время затухания (us) 
AUT_COFF = коэффициент усиления (0 - 1) 

[Signal] 
Signal= Настройка сигнала 
Cycle= Несколько срабатываний. 
MARK_CNT= несколько раз для одной команды маркировки 
DELAY = Задержка после запуска (ms) 
DLY_BETWEEN_MARK = задержка между двумя марками (ms) 
MARK_END_DELAY = задержка после завершения маркировки (ms) 
MARK_END_PULSE_W = длина сигнала конца маркировки (ms) 
B_MARK_ONCE= Режим запуска 
B_MARK_ONCEOption =Триггер уровня | Триггер края
Enable_Loop_Mdt = Маркировка после автономного цикла 
Enable_Loop_MdtOption = Не включать | включить
IOSELCOUNT = Количество сигналов для выбора файла I / O 
ENABLE_CARDTOUCH = Запуск нижнего устройства 
ENABLE_CARDTOUCHOption = Не включать | включить

[UI_FACE] 
ExportSysPara = Экспорт параметров... 
ImportSysPara = Импорт параметров... 
OK = Определение 
Cancel = Отменить 
Apply = Применение 

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]

0=Мастер настройки параметров лазерного оборудования

1=Предыдущий шаг

2=следующий шаг

3=сохранить

4=отменять


[DIALOG_POWER]

0=Шаг 2: Настройте конфигурацию оборудования выбранного вами лазера

1=Диапазон регулирования тока(%)

2=Минимальный ток(%):

3=Максимальный ток(A):

4=симулироватьQводить

5=номерQводить

6=QТип привода

7=Тип источника питания

8=CO2Размер мощности лазера

9=Обычный источник питания

10=Быстрая реакция на подачу питания

11=Больше или равно100 Вт

12=меньше100 Вт

13=Поддерживайте настройку импульса

14=частота(КГЦ)

15=Время выпуска(сша)

16=Ток холостого хода(%):

17=Максимальный рабочий цикл

18=Ток компенсации（%）

19=Настройки лазерного оборудования

20=МНастройка значения

21=Мстоить:

22=Корректирующий коэффициент:

23=нормальный

24=Слишком большой

25=Слишком маленький


[DIALOG_MODEL] 

0=Шаг 4: В соответствии с вашими предпочтениями выберите понравившийся вам метод управления

1=Совершенно новый метод управления, простой в эксплуатации, пользователю не нужно устанавливать какую-либо задержку,Но его можно использовать только на некоторых лазерах.

2=Традиционный метод управления лазером соответствует привычкам большинства людей, и все лазеры могут использовать этот метод.

3=Простой режим

4=Традиционная модель

5=Режим управления лазерной маркировкой

6=Тип квадратной головки

7=Режим с одной головкой

8=Двуглавый режим


[DIALOG_LaserType]

0=Тип лазера:

1= YAGлазер

2=DPлазер

3=Ультрафиолетовый лазер

4=CO2лазер

5=переводитьQВолоконный лазер

6=SPIлазер

7= LDлазер

8=YLPM (ЧЧМ-Ч)лазер

9=YLP-V2лазер

10= ИЛППлазер

11=HFM-Aлазер

12=HFM-P (HFM-P)лазер

13=HFM-Rлазер

14=HFM-Jлазер

15=МОПАЛазер с регулируемой шириной импульса

16 = непрерывный волоконно - оптический лазер 

17 = Сверхбыстрый лазер


[DIALOG_CONTENT]

0=Шаг 5: Поздравляем, все ваши настройки завершены, пожалуйста, сохраните соответствующие параметры


[LaserType_Explain]

0= YAGлазер

1= DPлазер

2=Ультрафиолетовый лазер

3=CO2лазер

4=переводитьQВолоконный лазер

5=SPIлазер

6= LDлазер

7=МоПаВолоконный лазер

8=YLP-V2лазер

9= ИЛППлазер

10=HFM-Aлазер

11=HFM-Pлазер

12=HFM-Qлазер

13=HFM-Jлазер

14=другое


[Model_Explain]

0=CO2 Простой режим

1=CO2 Традиционная модель

2= переводитьQ, Обычный источник питания+номерQ Традиционная модель

3= переводитьQ, Обычный источник питания+симулироватьQ Традиционная модель

4= переводитьQ, Быстрая реакция на подачу питания+номерQ Традиционная модель

5= переводитьQ, Быстрая реакция на подачу питания+симулироватьQ Традиционная модель

6= переводитьQ, Обычный источник питания+симулироватьQ Простой режим

7= переводитьQ, Быстрая реакция на подачу питания+номерQ Простой режим

8= переводитьQ, Быстрая реакция на подачу питания+симулироватьQ Простой режим

9= IPG режим

10=SPI Простой режим

11=SPI Традиционная модель

12= LD режим

13= ЧИСЛО оборотов в минуту (HFM-H) Традиционная модель

14= ЧИСЛО оборотов в минуту (HFM-H) Простой режим

15=YLP-V2 Традиционная модель

16=YLP-V2 Простой режим

17= ИЛПП Традиционная модель

18= ИЛПП Простой режим

19=HFM-A Традиционная модель

20=HFM-A Простой режим

21=HFM-P Традиционная модель

22=HFM-P (HFM-P) Простой режим

23=HFM-R Традиционная модель

24=HFM-R Простой режим

25=HFM-J Традиционная модель

26=HFM-J Простой режим

[DIALOG_ScanType]

0=Шаг третий: Установите тип гальванометра

1=Самодельный гальванометр

2=Другие гальванометры

3=подсказка:Пожалуйста, правильно выберите тип гальванометра, соответствующий машине, Для правильной работы самодельного гальванометра после включения питания его необходимо предварительно разогреть,Другие гальванометры не нуждаются в предварительном нагреве

;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------


;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

[PORTDIALOGTEXT]
STATIC_0 = Остановите обработку входного порта
STATIC_1 = Остановите обработку выходного порта
STATIC_2 = выходной порт
STATIC_3 = Защитное ограждение
STATIC_4 = входной порт
STATIC_5 = лазер готов к выходу
STATIC_6 = входной порт
STATIC_7 = выходной порт
STATIC_8 = Готовый к работе вывод программного обеспечения
STATIC_9 = выходной порт
STATIC_10 = выходная мощность лазера
STATIC_11 = порт
STATIC_12 = внешний выход красного света
STATIC_13 = выходной порт
STATIC_14 = входной порт
STATIC_15 = Отмеченный аккомпанемент
STATIC_16 = выходной порт
STATIC_17 = Окончание маркировки на выходе
STATIC_18 = выходной порт
STATIC_19 = ширина импульса
STATIC_20 = аварийный выход волоконного лазера
STATIC_21 = выходной порт
STATIC_22 = Начните отмечать порт
STATIC_23 = входной порт
IDC_CHECK_LASERWARN = Лазерная сигнализация обнаружения
IDC_CHECK_PLUSE_REVERSE = инверсия уровня сигнала Q
IDC_RADIO_NORMAL = Стандарт
IDC_RADIO_BICOLORLAMP = Двухцветный свет
IDC_RADIO_TRICOLORLIGHT = Трехцветный свет

[error]
1 = Карта не инициализирована или не найдена! 
2 = Сброс неудачный! 
3 = Неправильная версия карты! 
4 = Вызов тревоги! 
6 = Ошибка выполнения! 
7 = Состояние не соответствует! 
16 = Командный тайм - аут! 
17 = Команды потеряны! 
18 = асинхронный вызов интерфейса! 
19 = Интерфейс занят другими программами! 
20 = Превышение оси Z или исправление повреждения файла! 
21 = Параметры не совпадают! 
23 = Ошибка распределения памяти! 
100 = В автономном режиме! 
101 = Приказ приостановлен! 
1001 = Порт 1 
1002 = Порт 2 
1003 = Порт 3 
1004 = Порт 4 
1005 = Порт 5 
1006 = Порт 6 
1007 = Порт 7 
1008 = Лазерный вход не готов 
1009 = Лазерный вход готов.

;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= Настройка лазера
IDD_PROPPAGE_POWER= характеристики блока питания
IDD_PROPPAGE_SYS_SET=Настройки оборудования
IDD_PROPPAGE_TOUCH= Настройки педали
IDD_PORT_SET = Настройки порта

[IDD_DIALOG_HANSLASERSET]
CAPTION = Системные настройки
IDC_BTN_SAVE= Сохранить
IDCANCEL= Выход
LISTTITLE_NAME= Название элемента
LISTTITLE_VALUE= значение
;---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------